<template>
  <el-tabs v-model="activeTab">
    <el-tab-pane label="项目信息" name="author">
      <div class="text-content">
        <h1>Bilibili Column Helper - Bilibili 专栏助手</h1>
        <p>
          <a href="https://travis-ci.org/Yesterday17/Bilibili-Column-Helper"></a>
        </p>
        <a href="https://travis-ci.org/Yesterday17/Bilibili-Column-Helper"><img src="https://travis-ci.org/Yesterday17/Bilibili-Column-Helper.svg?branch=master">
        </a>
        <a href="https://ci.appveyor.com/project/Yesterday17/bilibili-column-helper">
          <img src="https://ci.appveyor.com/api/projects/status/ima7q96vi3y5y8r0?svg=true">
        </a>
        <a href="https://codebeat.co/projects/github-com-yesterday17-bilibili-column-helper-master-6e10e5a7-4172-448c-9dee-b3ddf67b0aa4">
          <img src="https://codebeat.co/badges/1263b75e-d5e8-4ad0-afe2-9da075ae1cde">
        </a>
        <p></p>
        <h2>原理</h2>
        <p>本程序以 Electron、Vue.js、Marked 以及 CodeMirror 为主要组件编写，旨在以 Markdown 书写目前并不支持 Markdown 的 Bilibili 专栏。<br>从原理来看，本程序将要实现的是将 Bilibili 支持的 HTML 特性以原本的方式渲染；而对于不支持的特性（比如表格等），则进行图片的渲染，以达到相同的显示目的。</p>
        <h3>用户隐私</h3>
        <p>本程序通过 Bilibili 提供的 Ajax 登录界面，实现 Bilibili 账户的登录。账户的使用仅限图片的上传以及专栏内容的上传。</p>
        <h2>合作开发(Contribution)</h2>
        <p>本工程基于
          <code>electron-vue</code>开发，其有相对完善的
          <a href="https://simulatedgreg.gitbooks.io/electron-vue/content/cn/">中文文档</a>可供参考。<br>前端框架使用的是
          <code>Vue.js</code>，文档
          <a href="https://cn.vuejs.org/">点此访问</a>。<br>UI 使用的是
          <code>Element</code>，文档
          <a href="http://element-cn.eleme.io">点此访问</a>。<br>以及
          <code>Electron</code>的文档：
          <a href="https://electronjs.org/">点此访问</a>。</p>
        <h3>构建过程</h3>
        <p>构建基于 yarn，如果没有安装 yarn 的话就需要执行第一步。在部分系统下（如 Ubuntu 等）使用
          <code>npm install -g</code>时需要带上
          <code>sudo</code>。</p>
        <pre><code>npm install -g yarn
yarn install
</code></pre>
        <p>如果在上述过程中遇到 electron 无法下载，可以选择使用
          <code>cnpm</code>或
          <code>npm</code>过渡：</p>
        <pre><code>cnpm install
</code></pre>
        <p>然后就可以通过以下步骤运行：</p>
        <pre><code>yarn dev
</code></pre>
        <p>如果需要打包，则需要运行：</p>
        <pre><code>yarn run build
</code></pre>
        <h1>Credits</h1>
        <p>
          <a href="https://github.com/zihengCat/bilibili-zhuanlan-markdown-tool">Bilibili zhuanlan Markdown-Tool</a>
        </p>
        <p>Icons made by
          <a href="http://www.freepik.com">Freepik</a> from
          <a href="https://www.flaticon.com/">www.flaticon.com</a> is licensed by
          <a href="http://creativecommons.org/licenses/by/3.0/">Creative Commons BY 3.0</a>.</p>
      </div>
    </el-tab-pane>
    <el-tab-pane label="哔哩哔哩专栏内容上传协议" name="upload-license">
      <div class="text-content">
        <p>您只有无条件同意《哔哩哔哩使用协议》及以下《哔哩哔哩专栏区内容上传协议》，才能在哔哩哔哩网的文章分区投稿。</p>
        <p>一、特别提示</p>
        <p>1.1 哔哩哔哩同意按照《哔哩哔哩使用协议》及本协议的规定及其不时发布的操作规则提供基于互联网的相关服务(以下称"网络服务")，为获得网络服务，服务使用人(以下称"用户")同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击"同意"按钮即表示用户完全接受《哔哩哔哩使用协议》及本声明项下的全部条款。这些条款可由哔哩哔哩域名所有者随时更新，本服务协议一旦发生变动，哔哩哔哩将会在相关的页面上提示修改内容。修改后的服务协议一旦在页面上公布即有效代替原来的服务协议。用户可随时造访查阅最新服务协议。用户在使用哔哩哔哩提供的各项服务之前，应仔细阅读本服务协议，如用户不同意本服务协议及/或随时对其的修改，用户可以主动取消哔哩哔哩提供的服务。</p>
        <p>1.2 哔哩哔哩作为信息分享、交流的服务平台，为用户提供原创信息的信息存储空间服务，用户应合法、有权的使用哔哩哔哩发表信息并单独对此承担法律责任。</p>
        <p>1.3 用户承诺不得以任何方式使用哔哩哔哩直接或间接从事违反中华人民共和国相关法律规定及社会公序良俗的行为，用户不得使用哔哩哔哩服务制作、复制、上载、发布、展示或以其它方式传播含有下列内容之一的信息：</p>
        <p>（1）反对宪法所确定的基本原则的；</p>
        <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
        <p>（3）损害国家荣誉和利益的；</p>
        <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
        <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
        <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
        <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
        <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
        <p>（10）含有法律、行政法规禁止的其他内容的信息。</p>
        <p>二、版权声明</p>
        <p>2.1 哔哩哔哩作为信息分享、交流的服务平台，尊重和鼓励用户原创内容，打造基于创作的文化原创社区。同时，哔哩哔哩也尊重任何第三方的合法权益。用户在使用哔哩哔哩发表信息时，不得以任何方式侵害任何第三方的合法权益，包括但不限于著作权、商标权、专利权、姓名权、隐私权等。</p>
        <p>2.2 用户使用哔哩哔哩发表的全部原创内容（包括但不限于文章、图片、视频等），其知识产权归用户所有。</p>
        <p>2.3 哔哩哔哩不会对用户上传的作品内容作任何形式的编辑修改。</p>
        <p>2.4 用户使用哔哩哔哩发表的信息，除非用户明确允许转载的，禁止任何第三方转载或者摘编（用户使用官方“生成图片”功能分享的除外）；若该用户允许第三方转载或摘编信息至哔哩哔哩之外的平台，应在转载内容的显著位置注明原作者姓名（或笔名、哔哩哔哩用户昵称），注明内容来源于哔哩哔哩且附有原始链接，并不对转载内容进行修改或演绎。</p>
        <p>2.5 对于用户使用哔哩哔哩发表的信息，若有相关权利人提出关于侵害著作权等合法权益的投诉，哔哩哔哩有权根据法律规定的要求删除相关信息。</p>
      </div>
    </el-tab-pane>
    <el-tab-pane label="哔哩哔哩专栏规范" name="column-rule">
      <div class="text-content">
        <p>&#12288;&#12288;欢迎各位使用Bilibili专栏，为了保证Bilibili专栏的内容质量，维护专栏的内容生态，让创作者和读者都拥有良好的使用体验和阅读体验，请各位谨遵以下规范条例： </p>
        <h3>严令禁止条例</h3>
        <p> &#12288;&#12288;bilibili严格遵守我国政府颁布的《互联网信息服务管理办法》第十五条规定，并将此作为bilibili平台运行的基本准则；对于含有以下内容的信息，我们将采用最严格的管理方法，予以杜绝： </p>
        <p>&#12288;&#12288;(一)反对宪法所确定的基本原则的； </p>
        <p>&#12288;&#12288;(二)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； </p>
        <p>&#12288;&#12288;(三)损害国家荣誉和利益的； </p>
        <p>&#12288;&#12288;(四)煽动民族仇恨、民族歧视，破坏民族团结的； </p>
        <p>&#12288;&#12288;(五)破坏国家宗教政策，宣扬邪教和封建迷信的； </p>
        <p>&#12288;&#12288;(六)散布谣言，扰乱社会秩序，破坏社会稳定的； </p>
        <p>&#12288;&#12288;(七)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； </p>
        <p>&#12288;&#12288;(八)侮辱或者诽谤他人，侵害他们合法权益的； </p>
        <p>&#12288;&#12288;(九)含有法律、行政法规禁止的其他内容的。 </p>
        <h3>一般违禁条例</h3>
        <p>&#12288;&#12288;为了保护用户创造的内容、维护良好的社区氛围，我们会对以下的行为进行处理，对作出以下行为的用户进行警告或处罚。 </p>
        <p>一、含有裸露和色情内容 </p>
        <p>&#12288;&#12288;文章中不允许含有性暗示类型的露骨内容，如色情描写、露点图片等。含有怪癖内容的文章，将会被删除或施加限制，具体取决于行为的严重程度。 </p>
        <p>&#12288;&#12288;禁止在文章及评论中发布与色情内容有关的第三方网址、社交账号、网盘代码等违规信息，一经发现，我们将对发布此类垃圾信息的账号永久封禁。 </p>
        <p>二、侵犯个人隐私 </p>
        <p>&#12288;&#12288;文章内容涉嫌跟踪、威胁、骚扰、胁迫、侵犯用户个人隐私、披露用户个人信息等情况，将会受到严肃处理。对于情节严重的用户，其账号将被永久封禁。 </p>
        <p>三、恶意冒充他人 </p>
        <p>&#12288;&#12288;禁止通过自己的账号信息（昵称、头像、签名、个人空间等），恶意模仿特定用户。另外，伪装成涉及官方业务的账号，同样也是不允许的，已对其他用户造成误导的，将受到相应的处罚。 </p>
        <p>四、欺诈、诈骗等行为 </p>
        <p>&#12288;&#12288;所有通过欺骗他人，为自己谋取经济利益的行为都是不允许的。我们会对此类内容进行删除，特定情况下会对发布者发出警示。 </p>
        <p>五、人身攻击 </p>
        <p>&#12288;&#12288;请不要对任何个人或群体进行嘲讽、发布仇恨言论、挑拨他人矛盾。此类行为经查证后我们会对其进行警告，情节严重的将会永久封禁。 </p>
        <h3>内容规范条例</h3>
        <p>一、标题党 </p>
        <p>&#12288;&#12288;为了保证Bilibili专栏的文章内容质量，我们拒绝各种以过度夸张、耸动的标题和内容去吸引人眼球的行为，标题党的标题种类包括但不限于: </p>
        <p>&#12288;&#12288;（1） 使用过度夸张的惊叹词； </p>
        <p>&#12288;&#12288;（2） 断章取义歪曲事实真相； </p>
        <p>&#12288;&#12288;（3） 故意营造悬念引人好奇； </p>
        <p>&#12288;&#12288;（4） 捏造正文中不存在的人、物、情节； </p>
        <p>&#12288;&#12288;（5） 题文不符，标题存在歧义。 </p>
        <p>二、广告信息 </p>
        <p>&#12288;&#12288;为了保证用户的阅读体验，我们拒绝各类恶意营销式的广告！ </p>
        <p>&#12288;&#12288;以下的内容会被视为广告，我们会对其进行相应处理: </p>
        <p>&#12288;&#12288;（1） 与投稿者个人以及文章内容无关的其他任何形式的推广； </p>
        <p>&#12288;&#12288;（2） 其他商业产品、品牌、活动的推广。 </p>
        <p>三、文章内容侵权 </p>
        <p>&#12288;&#12288;投稿者须保证自己的文章为原创内容，若文章内容被查实为抄袭或滥用他人文章，我们会退回该稿件并对发布者予以处罚。 </p>
        <p>四、文章中其他不适宜收录的内容 </p>
        <p>&#12288;&#12288;被认定为不适宜收录的内容种类包括但不限于： </p>
        <p>&#12288;&#12288;（1） 低创程度内容：文章不完整，主题不清晰，文章篇幅过短（200字以下）； </p>
        <p>&#12288;&#12288;（2） 图片与文章主题不相关或只是单纯的图集收录； </p>
        <p>&#12288;&#12288;（3） 社会新闻以及关于社会新闻的评论文章，如新闻爆料、如打砸抢烧、交通事故、火灾等突发事故、官司纠纷等； </p>
        <p>&#12288;&#12288;（4） 带有渲染社会负面现象，对于社会导向有误的文章。 </p>
      </div>
    </el-tab-pane>
    <el-tab-pane label="其他" name="others">
      <div class="text-content">
        <!--TODO: Add others here.-->
      </div>
    </el-tab-pane>
  </el-tabs>
</template>

<script>
export default {
  data () {
    return {
      activeTab: 'author'
    }
  },
  methods: {
  }
}
</script>

<style>
.text-content {
  height: 100%;
  border-radius: 4px;
  background-color: #f1f3f7;
  overflow: auto;
  padding: 5px 15px;
  font-size: 14px;
  font-family: "Helvetica Neue", Helvetica, "PingFang SC", "Hiragino Sans GB",
    "Microsoft YaHei", "微软雅黑", Arial, sans-serif;
}
</style>